stipendiya = ["""1.ГАС ‒ Государственная академическая стипендия

1.1ГАС назначается
• В зависимости от успехов в учебе на
основании результатов промежуточной
аттестации
• В соответствии с календарным графиком
учебного процесса
• С первого числа месяца, следующего за
месяцем окончания промежуточной
аттестации
• Не реже двух раз в год
Кому назначается:
 • Всем студентам 1 курса, обучающимся по очной форме обучения на бюджетной основе с начала 
учебного года по месяц окончания первой промежуточной аттестации в соответствии с календарным 
графиком учебного процесса 
• Иностранным гражданам, обучающимся на бюджетной основе в пределах квоты в течение всего 
периода прохождения обучения вне зависимости от успехов в учебе

Студент должен соответствовать следующим требованиям:
• Отсутствие по итогам промежуточной
аттестации оценки «удовлетворительно»
• Отсутствие академической задолженности"""],["""
1.2 Размеры стипендии
В первом семестре

1 895 руб./мес
Студентам бюджетной
очной формы обучения, ВО

700 руб./мес
Студентам бюджетной
очной формы обучения, СПО

17 000 руб./мес
Балл ЕГЭ по предмету
первого приоритета ≥85

20 000 руб./мес
Победители или призеры
олимпиады из перечня БВИ

После первой сессии

3 300 руб./мес
Сессия сдана на «хорошо»
или «хорошо» и «отлично»

4 300 руб./мес
Сессия сдана на «отлично»

1 895 руб./мес
(Стипендия иностранных
граждан, вне зависимости от
успехов в учебе (при наличии
оценки «удовлетворительно» и
академической задолженности).
При хорошо или отлично закрытой
сессии, сумма составляет 3 300 руб.
или 4 300 руб. соответственно.)"""
],["""

1.3 ГАС + социальная стипендия
Назначается:
• Детям-сиротам, детям, оставшимся без попечения родителей 
• Студентам в возрасте от 18 до 23 лет, потерявших в период обучения обоих родителей или 
единственного родителя 
• Инвалидам 1 и 2 групп, инвалидам с детства 
• Студентам, подвергшимся воздействию радиации вследствие катастроф 
• Студентам, являющимися инвалидами в следствие военной травмы
 ‒ 5 000 руб./мес  (Сессия сдана на «хорошо» или «хорошо» и «отлично»)  6 300 руб./мес  (Сессия 
сдана на «отлично»)
•Студентам в возрасте до 20 лет, имеющим только одного родителя - инвалида I группы, не имеющим 
права на получение социальной стипендии
   ‒ 14 000 руб./мес  (Сессия сдана на «хорошо» или «хорошо» и «отлично»)  14 700 руб./мес  (Сессия   
сдана на «отлично»)""", """
              
              2. ГСС ‒ Государственная социальная
стипендия 
"""
],["""
2.1 Кому назначается:
•Детям-сиротам, детям, оставшимся без попечения родителей
• Студентам в возрасте от 18 до 23 лет, потерявших в период
обучения обоих родителей или единственного родителя
• Инвалидам 1 и 2 групп, инвалидам с детства
• Студентам, подвергшимся воздействию радиации вследствие катастроф
• Студентам, являющимися инвалидами в следствие военной травмы
• Студентам из числа граждан, проходивших в течение не менее 3 лет
военную службу по контракту
• Студентам, получающим государственную социальную помощь

2.2 Как получить?

• Взять бланк заявления в офисе Профкома
• Заполнить по образцу и подписать в 11-08
на ул. Большая Морская, 67
• Собрать пакет документов и отнести в
деканат своего института/факультета

   """
],["""
2.3 Необходимые документы
Документами, подтверждающими соответствие студента одной из
социальных категорий граждан, являются: удостоверение; справки;
военный билет и контракт; уведомление о назначении
государственной социальной помощи, выдаваемое органом
социальной защиты населения по постоянному месту жительства.
Право на получение государственной социальной стипендии имеют
студенты, представившие в университет документ-уведомление о
назначении государственной социальной помощи, а также заявление,
подписанное директором института или деканом факультета и
председателем ППОСА и зарегистрированное в деканате.

2.4 Особенности:
Потеря одного из родителей не является причиной, чтобы
претендовать на социальную стипендию. Социальную
стипендию платят при потере обоих родителей или
единственного родителя, но это может стать косвенной
причиной низкого дохода семьи
Выплачивается при наличии оценок «удовлетворительно» и
академических задолженностей
Выплачивается при выходе в академический отпуск.
"""
],["""
3. ПГСС ‒ Социальная стипендия в
повышенном размере.

3.1 Кому назначается:
Студентам первого и второго курсов, обучающимся в федеральных
государственных образовательных организациях высшего образования
по образовательным программам высшего образования (программ
бакалавриата, программ специалитета), имеющим оценки
успеваемости «отлично» или «хорошо» или «отлично» и «хорошо» и
относящимся к категориям лиц, имеющих право на получение
государственной социальной стипендии или являющимися студентами
в возрасте до 20 лет, имеющими только одного родителя – инвалида I
группы, назначается государственная академическая и (или)
государственная социальная стипендия в повышенном размере.

   """
],["""
3.2 Особенности:

• Не может назначаться студентам 1 курса до прохождения
промежуточной аттестации
• Назначается на срок действия основания либо до окончания
студентом 2 курса
• В случае образования академической задолженности или
оценки «удовлетворительно», повышение ГСС отменяется
• Максимальный размер стипендии не ограничен


""","""

4. ПГАС ‒ Повышенная государственная академическая стипендия за достижения

4.1 Кому назначается и какие требования?
 ПГАС назначается на конкурсной основе по результатам работы студента за год, предшествующий 
получению стипендии. За достижения в соответствующих областях деятельности претендентам 
начисляются баллы в соответствии с критериями. 
Ты можешь претендовать на ПГАС, если:
 • Учишься на бюджете
 • Закрыл сессию без академических задолженностей и троек
 • Имеешь достижения в какой-либо деятельности (учебная, общественная, научно-
исследовательская, спортивная, культурно-творческая)
"""
],["""
4.2 Размер стипендии:

10 500 руб./мес  (За общественные, творческие или спортивные достижения)  С четвертого 
семестра.
13 500 руб./мес (За достижения в учебной или научной деятельности) С шестого семестра.

5. ГСП ‒ Государственная социальная помощь.

5.1 Кому назначается?
Получателями государственной социальной
помощи могут быть малоимущие семьи и
малоимущие одиноко проживающие граждане.
Если кто-либо из близких членов семьи получил
ГСП, можно взять справку о том, что вы являетесь
членом семьи, получившей ГСП, и на этом
основании оформить социальную стипендию.


5.2 Как получить?
Оформление ГСС для
получателей ГСП:
• Взять в вузе справку о том, что данный гражданин
является студентом и о том, в каком размере он
получает стипендию
• Собрать документы о доходах всех членов семьи
• Справка о составе семьи
   
   """
],["""
• С комплектом документов обратиться в МФЦ
• Получить документ, который будет подтверждать
оформление государственной социальной помощи
• Указанный документ о получении государственной
социальной помощи нужно принести в ВУЗ
и оформить ГСС по инструкции.
""", """
6.Материальная помощь

6.1 Кому назначается и какие требования?

Материальная помощь назначается студентам, обучающимся по очной бюджетной форме 
обучения, оказавшимся в тяжелом материальном положении. 
Материальная помощь обучающимся может быть оказана один раз в учебный семестр. (В 
экстренных случаях, по ходатайству института (факультета), ВУЦ, филиала, Совета обучающихся и 
Первичной профсоюзной организации студентов и аспирантов, – более одного раза в семестр.)
"""
],["""
Материальная помощь назначается:
 
• обучающимся, имеющим одного или обоих родителей инвалидов I и II группы; 
• обучающимся, оба родителя которых являются пенсионерами по старости; 
• обучающимся в связи с резким ухудшением состояния здоровья, требующим длительного или 
дорогостоящего лечения (частичная оплата медицинских операций, реабилитационных курсов, 
приобретение дорогостоящих медикаментов, профилактических прививок); 
• обучающимся, потерявшим близких родственников, опекунов или попечителей в случае 
совместного проживания, что привело к значительному снижению уровня жизни обучающегося; 
• обучающимся в связи с внезапной потерей трудоспособности единственного кормильца 
обучающегося; 
• обучающимся, ставшим жертвами чрезвычайных обстоятельств, (стихийных бедствий, аварий, 
вооруженных конфликтов, экологических катастроф, пожаров, эпидемий, несчастных случаев и 
т.д.);
   """
],["""
• обучающимся в связи с приведением в негодность жилого помещения, в котором проживает 
обучающийся, по независящим от него причинам (залив, аварийность, террористический акт, 
взрыв, пожар); 
• обучающимся в связи с рождением (усыновлением) ребенка; • обучающимся, воспитывающим 
ребенка в одиночестве (одинокая мать/отец); 
• обучающимся, находящимся на диспансерном учете в связи с хроническими заболеваниями; • 
обучающимся в связи с вступлением в брак (при условии, что с момента вступления в брак прошло 
не более шести месяцев); 
• обучающимся, вставшим на учет в медицинских организациях в связи с беременностью; • 
обучающимся из неполной или многодетной семьи; 
• обучающимся в связи со значительным ухудшением социально-бытовых условий жизни 
обучающегося; 
• обучающимся, оказавшимся в тяжелом материальном положении.

"""
],["""
6.2 Как получить?
Студентам бюджетной формы обучения:
• взять заявление в любом офисе Профкома 
• заполнить строго по образцу, обязательно одной ручкой и без помарок 
• подписать в деканате своего института/факультета 
• отнести заявление вместе с прилагаемыми документами (ксерокопией паспорта и 
документами, подтверждающими тяжелое материальное положение (при наличии)) в ауд. 11-05 
(ул. Большая Морская, 67).
Время работы ауд. 11-05: С понедельника по четверг с 11 до 13 часов и с 14 до 16. По пятницам 
приема нет!

Студентам контрактной формы обучения материальная помощь оказывается по ходатайству 
председателя профбюро.
Иностранные студенты оформляют материальную помощь через департамент международной 
деятельности (ауд. 14-51, БМ).
Материальная помощь приходит в даты выплаты государственной академической стипендии (с 25 
числа месяца по 30 включительно).
На данный момент стандартный размер материальной помощи составляет 8000 руб. (без учета 
налоговых вычетов). 
   """
],["""
Для студентов контрактной формы обучения размер материальной помощи может составлять до 
4000 руб. (выплачивается из средств профсоюзной организации). 
На материальную помощь студенты могут претендовать независимо от получения всех видов 
стипендий и успеваемости.
"""]


dekanates  = {'1':[""" Первый институт – Майоров Николай Николаевич
Почта: aerospace1@guap.ru
Номер: (812) 494-70-12
Младшие курсы – Кузнецова Надежда Александровна
Почта: maslova1@guap.ru
Номер: (812) 708-42-02"""], '2':"""Второй институт – Бестугин Александр Роальдович
Почта: zlata@aanet.ru
Номер: (812) 571-19-89
Младшие курсы – Андреева Екатерина Владимировна
Почта: fresgas@guap.ru
Номер: (812) 371-64-35""", '3': """Третий институт – Шишлаков Владислав Федорович
Почта: shishlakov@guap.ru
Номер: (812) 494-70-30
Младшие курсы – Полякова Татьяна Геннадьевна
Почта: 3dekanat@guap.ru
Номер: (812) 708-39-33""", '4': """Четвертый институт – Татарникова Татьяна Михайловна
Почта: dept4@aanet.ru
Номер: (812) 494-70-40
Младшие курсы – Малинина Ирина Георгиевна
Почта: dept4g@aanet.ru
Номер: (812) 708-39-43""", '6': 
"""Шестой институт – Лосев Константин Викторович
Почта: secretariat@hf-guap.ru
Номер: (812) 494-70-61 (Большая морская)(812) 708-43-45 (Гастелло)"""
, 'vyc':"""ВУЦ – Скуратов Вадим Вячеславович
Почта: ivo@guap.ru
Номер: (812) 571-08-26""",  '8': """ Восьмой институт – Будагов Артур Суренович
Почта: dean8@aanet.ru
Номер: (812) 315-50-47""", 'fpti': """ФПТИ – Фролова Елена Александровна
Почта: dek_ibmp@guap.ru
Номер: (812) 494-70-55
Младшие курсы – Пушкина Вера Павловна
Почта: –
Номер: (812) 708-38-59""", '12': """ Двенадцатый факультет – Поляков Сергей Леонидович
Почта: aviacollege@guap.ru
Номер: (812) 387-48-88"""}


vyc = ["""1 Что такое ВУЦ?
ВУЦ - это военный учебный центр при гражданском вузе, на котором 
студент может получить звание солдата (для гуманитарных направлений) 
или офицера (для технических специальностей) запаса, что освобождает 
от прохождения обязательной срочной службы. 
1.1 Сколько длится обучение 
Учеба в ВУЦ длится 2 года и может приходится на 2-3 или 3-4 семестры, в 
зависимости от того, когда ты сдавал нормативы и прозходил отбор: на 1 
или 2 курсе соответственно.
1.2 ВАЖНО 
Получение военно-учетной специальности в ВУЦ освобождает от срочной 
службы, но не от частичной мобилизации. Как метко выразился один из 
преподавателей ВУЦ: “Мы от армии не отмазываем, мы к армии готовим”
2. Как поступить в ВУЦ?"""],["""
2.2 Для того, чтобы поступить в ВУЦ необходимо пройти конкурсный 
отбор (заявление на который вы пишете в самом ВУЦ на собрании, о 
котором вам заранее сообщат). 
Подготовка к отбору:
После собрания ВУЦ будет необходимо получить талоны на обследование 
в военкомате района, к которому Вы принадлежите и пройти всех врачей, 
что на них указаны. После этого необходимо пройти тест на 
профпригодность в том же военкомате. Важно: необходимо иметь не ниже 
3 группы здоровья и 3 уровня профпригодности по результатам теста, 
иначе Ваши шансы на зачисление стремятся к нулю. 

Сам отбор:
Для отбора действует балльная система, где будут зачислены студенты с 
наивысшими общими баллами. Баллы складываются из следующего: 
успеваемость в семестре по результатам экзаменов, подтягивания, спринт 
100м и кросс 3км. Все физические нормативы сдаются в отдельнвй день, о 
котором Вам сообщат. Удачи."""]


hotels= {'1': ["""Общежитие №1, пр.Маршала Жукова, д.24
           
Основная информация
Общее состояние жилого фонда студенческого общежития:
общежитие имеет 15 этажей
жилые этажи секционной планировки: 3 секции по 6 комнат, одна - 5 
комнат
проживание: два человека в комнате
общее количество мест для проживания в общежитии – 537
Состояние мест общего пользования:
санузлы: туалетные кабины - две на секцию;
душевые: одна душевая кабина на секцию;
кухни: на две секции - одна кухня, на этаже две кухни;
для стирки одежды используются стиральные машины.

Транспорт
От главного здания ГУАП пешком до ст.м. «Адмиралтейская»
От метро «Автово»:
трамваи: №56, №60
автобусы: №229, №26, №2а, №300
маршрутные такси: № 60
От метро «Кировский завод»:
автобусы: №2, №111
маршрутные такси: №2, №306, №К41, №К195, №К245
От главного здания ГУАП, остановка «Театральная площадь»:
автобус и маршрутное такси №2 до остановки «ул.Маршала 
Казакова»
""",
 "https://vk.com/sso_1", 
 "https://guap.ru/m/dom/1",
 "zhukov.jpg"]
 , '2':
["""Общежитие №2, ул. Передовиков, д. 13

Основная информация
Общее состояние жилого фонда студенческого общежития:
общежитие имеет 12 этажей
жилые этажи квартирного типа, в квартире - две комнаты
проживание: 2-3 человека в комнатах
общее количество мест для проживания в общежитии – 922
Состояние мест общего пользования:
санузлы: туалетная кабина - одна на блок;
душевые: одна душевая кабина на блок;
кухни: одна кухня на 42 человека;
для стирки одежды используются стиральные машины.
Транспорт
От главного здания ГУАП пешком до ст.м. «Адмиралтейская».
От метро «Ладожская»:
трамваи: №10, 64, 8, 59
автобусы: № 92, 27, 77, 21, 24
троллейбусы: №1, №22
маршрутное такси: №К21, К64, К77, К92, К401
От главного здания ГУАП, остановка «Большая Морская ул. д.58»:
автобус №27 до остановки «ул. Передовиков»
""", 
"https://vk.com/sso2_guap", 
'https://guap.ru/m/dom/2', 
"peredovokov.jpg"], 

'3': ["""Общежитие №3, ул. Варшавская, д. 8

Основная информация
Общее состояние жилого фонда студенческого общежития:
общежитие имеет 5 этажей;
жилые этажи коридорного типа;
16 комнат на этаже;
проживание - три человека в комнате.
общее количество мест для проживания в общежитии – 227
Состояние мест общего пользования:
санузлы: туалетные кабины - восемь на этаже;
умывальные комнаты: две комнаты на этаже;
душевые: шесть душевых кабин на этаже;
кухни: две кухни на этаже;
для стирки одежды используется прачечная на цокольном этаже;
помещение для сушки белья: на каждом этаже.
Транспорт
От главного здания ГУАП пешком до ст.м. «Адмиралтейская».
От станции метро «Электросила» :
пешком 300 метров

""" ,
"https://vk.com/varshavskaj8", 
"https://guap.ru/m/dom/3",
"varshavskaya.jpg"
], 

"faq": ["""Как составляются списки на заселение?
Списки на заселение формируются на конкурсной основе по баллам ЕГЭ, 
с учётом всех льгот, т.е. сначала заселяются льготники, а дальше люди с 
самыми высокими баллами ЕГЭ и по убывающей. Каждый год баллы 
разные, поэтому сказать наверняка получишь ли именно ты место в 
общежитии или нет крайне непросто.

Почему мне в последний момент отказали в общежитии?
Скорее всего произошло следующее: человек, находившийся с тобой в 
одной очереди, принёс документы, подтверждающие льготу на заселение 
вне очереди. Соответственно, он получил место вперед тебя. 

Моё место в очереди на заселение увеличилось, что произошло?
 Основной период заселения в общаги закончился и очереди всех общаг 
сложились и заново ранжировались по баллам ЕГЭ. Например, ты был/а 3 
на заселение в Общагу №1, но после объединения со списками из 
остальных общаг ты занял/а 5-е место в очереди.
""", """
Хочу снять квартиру, но, боюсь, один не потяну, где найти хороших 
ребят для сожительства?
Для таких случаев был создан проект “Коммуналка”, доступ к 
особому чату ты можешь получить, написал это в общей беседе ГУАП в 
телеграмм.

Какие документы нужно подать для конкурса на общежитие?
-Ксерокопия паспорта 
-2 фото 3 на 4
-Ксерокопия ФЛГ
-Ксерокопия медицинской формы 086-у
-Документы, подтверждающие льготу (при наличии)
-Согласие родителей/законных представителей (если тебе меньше 18 лет)"""]}


bsk =["""1.1 Что такое БСК?
БСК — это бесконтактная смарт-карта или по-простому: 
льготный студенческий проездной (предназначен для студенев очной 
формы обучения). 
Существует 2 версии БСК: только метро и полный, 
позволяющий передвигаться и как метро, так и на наземном 
транспорте, однако он и стоит дороже в сравнении с первой версией. 
Актуальную цену на изготовление и пополнение БСК можно узнать 
на кассах метро и на официальном сайте метрополитена.
1.2 Как оформить БСК?
Существует несоклько способов офорить БСК:
Заказать БСК по ссылке Оформление БСК онлайн (ltkarta.ru) 
заполнив все поля, после изготовления (10 рабочих дней) карта 
будет доставлена на выбранную в анкете станцию метро, забрать её 
можно в кассах по предъявлению паспорта/свидетельства о 
рождении и студенческого билета. ""","""
Возможно заказать БСК непосредственно на кассе станции, 
предъявив паспорт/свидетельство о рождении, студенческий и свою 
фотографию 3 на 4. Срок изготовления тоже 10 рабочих дней.
Обратиться в “Центр изготовления льготных БСК” по адресу: 
Чернорецский переулок дом 3. При себе необходимо иметь: паспорт, 
студенсеский, документ подтверждающий льготу (при наличии)

ВАЖНО: 
1. БСК оформляется для лиц, имеющих постоянную или временную 
прописку в СПБ.
2. БСК изготавливается при наличии информации о студенте от учебных 
заведений в базе данных метрополитена.
""", "card.jpg"]


history =["""1 История основания ГУАП
Датой рождения университета считается 25 января 1941 года, когда в 
тревожное предвоенное время, в период бурного развития авиации, вышло 
Постановление Правительства о создании в Ленинграде авиационного 
института (ЛАИ).

В годы войны шло бурное развитие не только самолетостроения – 
быстрыми темпами стало развиваться и бортовое оборудование, приборы 
и системы управления, для разработки, производства и эксплуатации 
которых требовались квалифицированные специалисты. В связи с этим в 
феврале 1945 года ЛАИ был преобразован в Ленинградский институт 
авиационного приборостроения (ЛИАП).
Шли годы, в ЛИАП открывались новые специальности, но главное, что 
характеризовало 60–90­е годы, – это рост научно­педагогического 
потенциала вуза, увеличение числа кандидатов и докторов наук, 
повышение качества подготовки молодых специалистов. В институте 
успешно работали аспирантура и докторантура: по числу преподавателей""",""" с 
учеными степенями и званиями, по числу докторов наук вуз стал занимать 
одно из первых мест в городе и стране. В институте появились лауреаты 
различных премий, заслуженные деятели науки и техники.
Уже в 80­е годы ЛИАП был признан и вошел в число ведущих вузов 
страны. С 1985 года институт стал головным в стране в области целевой 
интенсивной подготовки специалистов, c 1989 года – одним из первых в 
стране приступил к подготовке инженеров­исследователей, тем самым 
подготовив методологическую основу реализации многоуровневого 
образования.
80­е и 90­е годы ознаменовались также расширением профиля подготовки 
выпускаемых специалистов. Были открыты новые направления и 
специальности – экономические, юридические, расширился перечень и 
профиль технических специальностей. Институт стал готовить 
специалистов по нескольким десяткам специальностей и специализаций 
дневной, вечерней и заочно-­дистанционной форм обучения.""","""
Фундаментализация и универсализация подготовки специалистов и 
ученых привели к тому, что институт получил сначала статус 
Государственной академии аэрокосмического приборостроения (ГААП), а 
затем, после очередной аттестации и аккредитации в 1997 году, – статус 
университета. Ныне полное название вуза – Санкт­Петербургский 
государственный университет аэрокосмического приборостроения 
(ГУАП)

2 История корпусов ГУАП
2.1 История корпуса на Гастелло
Один из корпусов Санкт-Петербургского государственного 
университета аэрокосмического приборостроения расположен в 
прекрасном здании, памятнике архитектуры XVIII века - Чесменском 
дворце.
За многолетнюю историю своего существования Чесменский дворец 
много раз перестраивался и во многом изменил свой первоначальный 
облик. Но и в настоящем виде, овеянный романическими легендами и 
сохранивший свое историческое название, он является значительным ""","""
памятником отечественной истории.
В старину на месте нынешнего Чесменского дворца стояла 
деревянная дача под названием Кикерейскино или Кикерико, на этой даче 
останавливался двор и важные особы при проездах из Санкт-Петербурга в 
Царское Село. Эта дача стояла по левой стороне царскосельской дороги на 
седьмой версте, на плоском месте, покрытом кустарником и диким лесом.
В 1774 году по приказу Екатерины II началось строительство путевого 
дворца - для кратковременных остановок императорского двора во время 
переездов из Санкт-Петербурга в Царское Село. Подготовить проект было 
поручено академику архитектуры Ю.М. Фельтену, и к 1777 году 
архитектор возвел путевой увеселительный замок, по официальным 
документам значившийся как «каменный дворец, что не доезжая Средней 
Руки».
Небольшое двухэтажное здание, располагалось «на возвышенном лугу, 
окружённом земляным валом, обросшим травою». Дворец должен был 
создавать иллюзию родового рыцарского замка. Со стен дворца на его ""","""
гостей, глядели многочисленные изображения родственников Екатерины 
II и родственных царствующих домов. Он был построен в модном тогда 
псевдоготическом стиле.
План здания начертан по образу Лонгдфортского дворца (1591, архитектор 
Джон Торп), взятому из 5-го тома "Архитектуры" Витрувия: 
равносторонний треугольник с круглыми башнями по углам и обширным 
Парадным залом в центре. Центральный круглый зал в нижнем этаже 
перекрыт низким купольным сводом с распалубками, зал верхнего этажа 
— невысоким куполом, прорезанным овальными окнами и украшенным 
лепными филёнками и росписью. Внешние стены центрального 
купольного зала возвышались над всей постройкой и представляли собой 
своеобразную корону. Все три фасада были решены одинаково: нижний 
этаж обработан рустом, верхний оштукатурен. Различие в облицовке на 
разных уровнях стен создавало иллюзию, что строился-достраивался 
замок, как и положено, в течении столетий.""","""
В обработке фасадов использованы элементы готической архитектуры - 
стрельчатые окна, зубчатые парапеты по стенам. Первоначально комплекс 
дворца представлял собой крепость, окруженную рвами с водой. Въезды 
со стороны царскосельской дороги напоминали триумфальные арки с 
дозорными башнями, тоже в стиле древних английских владений, к 
воротам вели мосты с гранитными тумбами. Вдобавок, от дороги к замку 
провели узкую аллею и засадили её липами.
Первоначально дворец назывался «Дворец на лягушачьем болоте». 
Местность вокруг носила название «Кикерикексен» что по-фински значит 
«лягушачье болото» поэтому, когда строительство дворца было закончено, 
он получил название Кикерикексенского. А лягушка, исконный житель 
этих мест, поселилась на гербе нового замка. Позже, в праздднование 10 
лет побелы в Чесменском сражении дворец переименовали и он получил 
уже привычное нам название “Чесменский”.
Позже, после смерти Екатерины II, дворец пришел в запустение, потому ""","""
как взошедщий на престол Павел I предпочитал отдых в оранембауме и 
путевой дворец на пути в Царское село ему был не нужен. Так бы и 
разрушилось дорогое нашему сердцу здание, но нашелся выход: из дворца 
была сделана богадельня - дом для ветеранов-инвалидов. Для большей 
вместительности были с 1831 по 1836 годы пристроены 3 двухэтажных 
флигеля которые в 1930-х, были надстроены еще на 2 этажа после 
“заселения” в это здание автодорожного института, позже уступившего 
это место ЛАИ - современному ГУАПу. Так чесменский дворец обрел 
привычный нам вид.

2.2 История корпуса на Большой морской

Отрывок из книги «Большая Морская» авторов Ларисы Бройтман, Елены 
Красновой
Участок за переулком «на погорелых местах» от Главной 
полицмейстерской канцелярии получил генерал-фельдмаршал граф Петр 
Иванович Шувалов и на отведенном месте построил каменный дом. Его 
сын Андрей Петрович Шувалов в 1764 году продал строение вместе с 
садом и остатками кирпича и камня купцу Брумбергу, владельцу ""","""
соседнего дома. Огромный двор, с устроенными на нем лесными 
складами, простирался от Мойки до нынешней улицы Якубовича.
В 1765 году «со второго дня святыя пасхи» на пустыре Брумберга на 
средства Полицмейстерской канцелярии открылся бесплатный 
«Всенародный» театр, куда допускались все желающие. Театр был 
истинно демократическим (Штелин назвал его вульгарным), здесь бывала 
и «чернь», и купцы, и чиновники, и не только представители аристократии 
- приезжал и наследник Павел Петрович, и даже императрица. Простые 
зрители довольствовались штабелями леса, а благородные смотрели 
спектакль, не выходя из колясок. На открытой сцене играла, в сущности, 
любительская труппа, в основном - наборщики академической 
типографии, получавшие от полиции по 50 копеек за спектакль. Один из 
них был «медиатором» - режиссером. Играли обычно «французские штуки 
на наши русские манеры обделанные».
В связи с упомянутым театром можно привести интересный пример ""","""
русской театральной критики XVIII века - письмо В.И. Лукина к Б.Е. 
Ельчанинову. Оба они принадлежали к кружку И.П. Елагина, занимались 
драматургией, стремились превратить театр в национально-
воспитательное учреждение. Отрывок из письма: «О сем позорище (в те 
времена — синоним слова «зрелище» - авт.), может быть, ты и не слыхал, 
живучи в стране, о театре нимало не пекущейся, и я согрешил бы пред 
тобой, не уведомив тебя о том, что сведения всякого человека, пользу 
общественную любящего, достойно. Со второго дня святой пасхи 
открылся сей театр. Он сделан на пустыре за Малой Морской (так тогда 
часто называли часть Большой Морской за Исаакиевской площадью. - 
авт.). Наш низкой степени народ так великую жадность к нему показал, 
что оставя другие свои забавы... ежедневно на оное зрелище сбирается... 
Словом, я искренне тебя уверяю, что сие для народа упражнение весьма 
полезно и потому похвалы достойно».""","""
В 1770 году участок купил «санкт-петербургский купец французской 
нации» И.А. Поше. Он собирался построить здесь каменный театр, но 
умер, не успев осуществить своего намерения.

В конце XVIII века территорию занимал плац лейб-гвардии 
Кавалергардского полка. В 1807 году казармы Кавалергардского полка, 
расположенные за плацем и вдоль канала на месте Конногвардейского 
бульвара, отданы полку Конной гвардии, и на более поздних планах на 
месте современного дома 67 показано «Конногвардейское парадное 
место». На плацу проводились парады и учения на крупных тяжелых 
конях обязательно вороной масти.
Бывший Провиантский переулок стал называться Конногвардейским и 
носит это название до сих пор, а Конногвардейский полк располагался в 
этом районе почти до самой революции. Свою историю полк Конной 
гвардии вел от «лейб-шквадрона» — личного конвоя А.Д. Меншикова, 
который участвовал в Северной войне, сражался под Полтавой. В 1730 ""","""
году Анна Иоанновна, увеличив личный состав эскадрона до тысячи 
человек, назвала его Конногвардейским полком. Отличился полк в 
сражениях при Бородине, Кульме, Лейпциге, имя его золотыми буквами 
написано на арке Нарвских ворот. Шефами полка состояли почти все цари 
и царицы от Анны Иоанновны до Николая II.
В 1820 году в полку была устроена школа взаимного обучения по 
ланкастерской системе для 50 нижних чинов, которую через два года 
заменили Училищем военных кантонистов для солдатских детей. В 
«Алфавите декабристов» числятся 11 офицеров Конной гвардии, в том 
числе поэт-декабрист А.И. Одоевский. 14 декабря 1825 года около 12 
часов дня сюда прибыл генерал-губернатор М.А. Милорадович, чтобы 
вывести полк против восставших, но не дождался и уехал на Сенатскую 
площадь: офицеры собирались долго, так как многие конногвардейцы 
сочувствовали восставшим. Но командовавший полком А.Ф. Орлов все же 
вывел его в поддержку Николаю I.""","""
В 1844 году командиром полка стал П.П. Ланской, женившийся в это 
время на вдове А.С. Пушкина Наталье Николаевне. Оба сына Пушкина 
позже служили под началом своего отчима. В годы командования 
Ланского на территории полка осуществлено много перестроек и новых 
построек. В 1849 году на создавшейся в связи со строительством моста 
через Неву Благовещенской площади (ныне площадь Труда) К.А. Тоном 
возведена полковая церковь Благовещения (не сохранилась). Между вновь 
проложенной Благовещенской улицей (ныне улица Труда) и 
Конногвардейским переулком на месте плаца в 1844 — 1849 годах 
архитектор Иван Денисович Черник построил офицерский корпус 
Конногвардейского полка (дом 67).

Интересна биография Черника. Он родился в 1811 году в Екатеринодаре 
(Краснодар) в семье казака. В 12 лет пешком пришел в Петербург для 
поступления в Академию художеств, окончив которую получил звание 
классного художника архитектуры. Будучи пансионером Черноморского ""","""
войска, получил возможность ознакомиться с военной архитектурой в 
Европе. Впоследствии был генерал-майором, потом тайным советником, 
профессором Академии художеств. Над входом в здание, построенное 
Черником, с гранитным цоколем и порталом, рустованной штукатуркой и 
оригинальным аттиком до сих пор сохранились знаки военной доблести — 
знамена, шлемы, латы.


В 1900 году в этом доме работал Санкт-Петербургский окружной военный 
суд. Сейчас в этом громадном доме располагается Санкт-Петербургский 
государственный Университет аэрокосмического приборостроения. В 
январе 1941 года на базе Автодорожного института, выделившегося в 1930 
году из Института инженеров путей сообщения, был организован 
Ленинградский авиационный институт, помещавшийся в здании бывшей 
Чесменской богадельни около Московского проспекта. В 1960-х годах 
институт, получивший название Ленинградского института авиационного 
приборостроения, занял в дополнение к старому зданию этот дом на 
Большой Морской улице.
""","""
За зданием университета аэрокосмического приборостроения проходит 
улица Труда (бывшая Благовещенская), а немного дальше — Крюков 
канал, прорытый от Невы до Мойки в 1719 году (получивший имя 
подрядчика Семена Крюкова, руководившего работами). Между ними 
находится мост через Мойку. В постановлении комиссии о Санкт-
Петербургском строении в 1738 году мост через речку Мойку у Крюкова 
канала назван Цветным. Следующий мост у Галерного двора 
(Храповицкий) — Желтым, а поскольку были мосты Зеленый, Красный, 
Синий и Белый, то по распоряжению Комиссии следовало «против 
которых званиев те мосты... выкрасить». Хотелось бы увидеть, какой 
краской выкрасили Цветной мост. Не зря это название вскоре исчезло. На 
более поздних планах мост называется Желтым или Поцелуевым. 
Последнее закрепившееся за ним название связывают с названием 
должности содержателя кабака «целовальник» или с фамилией кабатчика 
«Поцелуев».
Считают, что кабак находился на противоположном берегу Мойки. ""","""
Возможно, и там был кабак, но на плане 1755 года в глубине участка на 
этой стороне показан «старый кабак» и на берегу Мойки отведено место 
для нового.
В течение летнего сезона 1816 года Поцелуев мост построен заново из 
чугуна по проекту архитектора и инженера В.И. Гесте. Газета «Северная 
почта» 12 августа 1816 года сообщала: «Ящики, из коих он состоит, 
отлиты за 2637 верст отсюда на Пермских г. тайного советника Демидова 
(Николая Никитича - авт.) заводах... Величиною, отделкою и красотою, 
ровно как и скоростью построения превосходит он другие здесь доселе 
воздвигнутые мосты... Таковые мосты, коим подобных в таковом числе 
нет ни в одной столице Европы...»

2.3  История корпуса на Ленсовета
Создан в 1930 г. как Ленинградский дорожно-автомобильный 
исследовательский техникум (ДАИТ). В 1932 г. техникум приступил к 
строительству своего учебного корпуса на южной окраине города. 
Недалеко находился Автодорожный институт, расположенный в здании ""","""
Чесменского монастыря (в будущем - институт авиаприборостроения, в 
настоящем - университет аэрокосмического приборостроения). В 1935 г. 
строительство было завершено.
В феврале 1941 г. ДАИТ преобразован в Ленинградский авиационный 
техникум.
В 1967 г. на старом месте вместо деревянного корпуса был построен 
каменный - площадью 14,5 тыс. кв. м.
Строительная эпопея продлилась 8 лет. (т. е. здание было заложено в 1959 
г. ).
В 1991 г. техникум был преобразован в Ленинградский колледж 
авиационного приборостроения и автоматики.
В 2008 г. , вместе с Электротехническим колледжем, преобразован в 
факультет среднего проф. образования (ФСПО) ГУАПа и переехал в 
другое здание.

3 Будущее ГУАПА
Это ты! (вставить смайлик)

"""]

if __name__=="__main__":
    print(len(history))